Conf.Simple/src/Catalogs/SUI_НастройкиМобильныхУстройств/SUI_НастройкиМобильныхУстройств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиМобильныхУстройств</name>
  <attributes>
    <name>РазмерШрифтаЗаголовкаТаблицы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШрифтаОсновнойИнформации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШрифтаДополнительнойИнформации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерШтрифтаОтсутствияВНастройке</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналУдачногоСобытия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналПредупреждения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналОшибки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СигналУведомления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьВводФакта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОфлайнРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОфлайнРежимГрупповойРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтключитьОбмен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольGTIN</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьУстаревшиеДокументы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияДокументовВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьДокументыСоСтатусамиСтрокой</name>
    <comment>Значения разделенные через ;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛоговНаСтранице</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХраненияЛоговВДнях</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УровеньЛогирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>5</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьСтекВызовов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОфлайнПечать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <comment>&quot;1С&quot; или &quot;ZPL&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоединенияПринтера</name>
    <comment>&quot;BT&quot; или &quot;WiFi&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>MACАдресBTПринтера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>17</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IPАдресWiFiПринтера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>19</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерИспользовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерИспользованиеКомандИнтентов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерIntentScannerMessage</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерIntentScannerVariable</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АппаратныйСканерIntentScannerLength</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольУникальностиСерий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьСерииБезПредупреждения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждениеПриУдаленииДубля</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МассовоеСканированиеВСериях</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СимволыРазелители</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПереносСтрокиКакРазделитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МинимальнаяДлинаСимволовШтрихкода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальнаяДлинаСимволовШтрихкода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьУстаревшиеЛоги</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Conf.Simple/src/Catalogs/SUI_НастройкиМобильныхУстройств/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения = Неопределено Тогда
		
		Если ПустаяСтрока(АдресСервера) Тогда
			АдресСервера = SUI_SimpleВызовСервера.ПолучитьАдресПубликацииИнформационнойБазы();
		КонецЕсли;
		
		Если Не ОсновнаяНастройкаСуществует() Тогда
			ОсновнаяНастройка = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ОсновнаяНастройка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если АппаратныйСканерИспользовать И АппаратныйСканерИспользованиеКомандИнтентов Тогда
		
		ПроверяемыеРеквизиты.Добавить("АппаратныйСканерIntentScannerMessage");
		ПроверяемыеРеквизиты.Добавить("АппаратныйСканерIntentScannerVariable");
		ПроверяемыеРеквизиты.Добавить("АппаратныйСканерIntentScannerLength");
		
	КонецЕсли;
	
	ПроверитьКоличествоЛоговНаСтранице(Отказ);
	ПроверитьУровеньЛогирования(Отказ);
	ПроверитьШаблонЭтикетки(Отказ);
	ПроверитьПротоколПечати(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбработатьСтрокуУдалятьДокументыСоСтатусамиСтрокой();
	
	Если ОсновнаяНастройкаСуществует() Тогда
		ОсновнаяНастройка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПроверитьКоличествоЛоговНаСтранице(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить(20);
	ДоступныеЗначения.Добавить(50);
	ДоступныеЗначения.Добавить(100);
	
	Если ДоступныеЗначения.Найти(КоличествоЛоговНаСтранице) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Количество логов на странице может принимать значения: %1.'"),
			СтрСоединить(ДоступныеЗначения, ", "));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "КоличествоЛоговНаСтранице", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьУровеньЛогирования(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить("OFF");
	ДоступныеЗначения.Добавить("DEBUG");
	ДоступныеЗначения.Добавить("INFO");
	ДоступныеЗначения.Добавить("ERROR");
	
	Если ДоступныеЗначения.Найти(УровеньЛогирования) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Уровень логирования может принимать значения: %1.'"), 
			СтрСоединить(ДоступныеЗначения, ", "));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "УровеньЛогирования", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьШаблонЭтикетки(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить("ZPL");
	ДоступныеЗначения.Добавить("1C");
	
	Если ДоступныеЗначения.Найти(ШаблонЭтикетки) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Шаблон этикетки может принимать значения: %1.'"), 
			СтрСоединить(ДоступныеЗначения, ", "));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ШаблонЭтикетки", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПроверитьПротоколПечати(Отказ)
	
	ДоступныеЗначения = Новый Массив();
	ДоступныеЗначения.Добавить("BT");
	ДоступныеЗначения.Добавить("WiFi");
	
	Если ДоступныеЗначения.Найти(ТипСоединенияПринтера) = Неопределено Тогда
		ТекстОшибки = СтрШаблон(НСтр("ru = 'Тип соединения печати может принимать значения: %1.'"), 
			СтрСоединить(ДоступныеЗначения, ", "));
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, , "ТипСоединенияПринтера", "Объект", Отказ);
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Процедура ОбработатьСтрокуУдалятьДокументыСоСтатусамиСтрокой()
	
	УдалятьДокументыСоСтатусамиСписок = Справочники.SUI_НастройкиМобильныхУстройств
		.ПолучитьСписокУдалятьДокументыСоСтатусами(ЭтотОбъект);
		
	УдалятьДокументыСоСтатусамиМассив = Новый Массив();
	
	Для Каждого ЭлементСписка Из УдалятьДокументыСоСтатусамиСписок Цикл
		
		Если ЭлементСписка.Пометка Тогда
			УдалятьДокументыСоСтатусамиМассив.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
		
	КонецЦикла;
	
	УдалятьДокументыСоСтатусамиСтрокой = НРег(СтрСоединить(УдалятьДокументыСоСтатусамиМассив, ";"));
	
КонецПроцедуры

Функция ОсновнаяНастройкаСуществует()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	SUI_НастройкиМобильныхУстройств.Ссылка
		|ИЗ
		|	Справочник.SUI_НастройкиМобильныхУстройств КАК SUI_НастройкиМобильныхУстройств
		|ГДЕ
		|	SUI_НастройкиМобильныхУстройств.ОсновнаяНастройка
		|	И SUI_НастройкиМобильныхУстройств.Ссылка <> &Ссылка";
	
	Возврат Не Запрос.Выполнить().Пустой();
	
КонецФункции

#КонецОбласти

#Область Инициализация

#КонецОбласти

#КонецЕсли
